// Задача 2 
/*
Console.Write("Напишите первое число для сравнения ");
int num1 = Convert.ToInt32(Console.ReadLine());

Console.Write("Напишите второе число для сравнения ");
int num2 = Convert.ToInt32(Console.ReadLine());

if(num1 > num2)
    Console.Write("Максимамальное число " + num1);
else
    Console.Write("Максимальное число " + num2);
*/
