// Задача 2 
/*
Console.Write("Напишите первое число для сравнения ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Напишите второе число для сравнения ");
int num2 = Convert.ToInt32(Console.ReadLine());

if(num1 > num2)
    Console.Write("Максимамальное число " + num1);
else
    Console.Write("Максимальное число " + num2);
*/

//Задача 4

/*
Console.Write("Напишите первое число для сравнения ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Напишите второе число для сравнения ");
int num2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Напишите третье число для сравнения ");
int num3 = Convert.ToInt32(Console.ReadLine());
int max = num1;

if(max < num1)
    max = num1;
if(max < num2)
    max = num2;
if(max < num3)
    max = num3;

Console.Write("Максимальное число " + max);
*/

//Задача 6

/*
Console.Write("Напишите число ");
int num = Convert.ToInt32(Console.ReadLine());

if(num % 2 == 0)
    Console.Write(num + " Является четным");
else
    Console.Write(num + " Не является четным");
*/

//Задача 8

/*
Console.Write("Введите положительное число ");
int num = Convert.ToInt32(Console.ReadLine());
int corrent = 1;

while(corrent <= num)
{
    if(corrent % 2 == 0)
        Console.Write(corrent + " ");
    corrent++;
}
Console.Write("Все четные число от 1 до " + num);
*/